In [4]:
import sys
print(sys.version)

3.8.5 (default, Sep  3 2020, 21:29:08) [MSC v.1916 64 bit (AMD64)]

In [5]:
import platform
print(platform.version)

<function version at 0x0000001A65206550>

In [6]:
platform.python_version()

'3.8.5'

In [8]:
#create series from a list
import numpy as np
import pandas as pd

In [9]:
first_series=pd.Series(list('abcdef'))

In [10]:
print(first_series)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [11]:
#create series from ndarray
np_country=np.array(['Luxembourg','Norway','Japan','Switzerland','United States','Qatar','Iceland','Sweden','Singapore','Denmark'])

In [12]:
s_country=pd.Series(np_country)

In [13]:
print (s_country)

0       Luxembourg
1           Norway
2            Japan
3      Switzerland
4    United States
5            Qatar
6          Iceland
7           Sweden
8        Singapore
9          Denmark
dtype: object

In [14]:
#Evaluate countries and their corresponding gdp per capita and print them as series
dict_country_gdp=pd.Series([52056.01781,40258.80862,40034.85063,39578.07441,39170.41371,37958.23146,37691.02733,36152.66676,34706.19047,33630.24604,33529.83052,30860.12808],index=['Luxembourg','Macao,China','Norway','Japan','Switzerland','Hong Kong , China','United States','Qatar','Iceland','Sweden','Singapore','Denmark'])

In [15]:
print (dict_country_gdp)

Luxembourg           52056.01781
Macao,China          40258.80862
Norway               40034.85063
Japan                39578.07441
Switzerland          39170.41371
Hong Kong , China    37958.23146
United States        37691.02733
Qatar                36152.66676
Iceland              34706.19047
Sweden               33630.24604
Singapore            33529.83052
Denmark              30860.12808
dtype: float64

In [16]:
#Print Series with scalar input 
scalar_series=pd.Series(5.,index=['a','b','c','d','e'])

In [11]:
scalar_series

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [17]:
#access elements in the series
dict_country_gdp[0]

52056.01781

In [17]:
# access first 5 countries from the series
dict_country_gdp[0:5]

Luxembourg     52056.01781
Macao,China    40258.80862
Norway         40034.85063
Japan          39578.07441
Switzerland    39170.41371
dtype: float64

In [18]:
#Lookup a country by name or index
dict_country_gdp.loc['United States']

37691.02733

In [19]:
dict_country_gdp.iloc[0]

52056.01781

In [20]:
#Vectorised operations in Series
first_vector_series=pd.Series([1,2,3,4],index=['a','b','c','d'])
second_vector_series=pd.Series([10,20,30,40],index=['a','b','c','d'])

In [21]:
first_vector_series+second_vector_series

a    11
b    22
c    33
d    44
dtype: int64

In [22]:
second_vector_series=pd.Series([10,20,30,40],index=['a','d','b','c'])

In [23]:
first_vector_series+second_vector_series

a    11
b    32
c    43
d    24
dtype: int64

In [24]:
# replace few indexes in new ones in second vector series
second_vector_series=pd.Series([10,20,30,40],index=['a','b','e','f'])

In [26]:
first_vector_series+second_vector_series

a    11.0
b    22.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

In [27]:
#Create Dataframe from Lists
import pandas as pd

In [28]:
#Last five olympics data : place ; year and number of countries participated
olympic_data_list={'Hostcity':['London','Beijing','Athens','Sydney','Atlanta'],'Year':[2012,2008,2004,2000,1996],
                  'No. of participating countries':[205,204,201,200,197]}

In [29]:
df_olympic_data=pd.DataFrame(olympic_data_list)

In [30]:
df_olympic_data

  Hostcity  Year  No. of participating countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

In [31]:
#Create dataframe from dict of dicts
olympic_data_dict={'London':{2012:205},'Beijing':{2008:204}}

In [32]:
df_olympic_data_dict=pd.DataFrame(olympic_data_dict)

In [33]:
df_olympic_data_dict

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

In [34]:
# select by city name
df_olympic_data.Hostcity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: Hostcity, dtype: object

In [35]:
  df_olympic_data.describe

<bound method NDFrame.describe of   Hostcity  Year  No. of participating countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197>

In [36]:
#Create dataframe from dict of series
olympic_series_participation=pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])
olympic_series_country=pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],index=[2012,2008,2004,2000,1996])

In [37]:
df_olympic_series=pd.DataFrame({'No of participating countries': olympic_series_participation,'Host cities':olympic_series_country})

In [38]:
df_olympic_series

      No of participating countries Host cities
2012                            205      London
2008                            204     Beijing
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta

In [39]:
#Create dataframe from ndarray
import numpy as np
np_array=np.array([2012,2008,2004,2006])
dict_ndarray={'year':np_array}

In [41]:
df_ndarray=pd.DataFrame(dict_ndarray)
df_ndarray

   year
0  2012
1  2008
2  2004
3  2006

In [43]:
#Create dataframe from dataframe
df_from_df=pd.DataFrame(df_olympic_series)
df_from_df

      No of participating countries Host cities
2012                            205      London
2008                            204     Beijing
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta

In [13]:
df_olympic_series.describe

<bound method NDFrame.describe of       No of participating countries Host cities
2012                            205      London
2008                            204     Beijing
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta>

In [44]:
#view top two records
df_olympic_series.head(2)

      No of participating countries Host cities
2012                            205      London
2008                            204     Beijing

In [45]:
#view last 3 records
df_olympic_series.tail(3)

      No of participating countries Host cities
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta

In [46]:
#view indexes of dataset
df_olympic_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [47]:
#view columns of the dataset 
df_olympic_series.columns

Index(['No of participating countries', 'Host cities'], dtype='object')

In [48]:
#select data for Host cities
df_olympic_series['Host cities']

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host cities, dtype: object

In [49]:
# Select lable-location based access by label 
df_olympic_series.loc[2012]

No of participating countries       205
Host cities                      London
Name: 2012, dtype: object

In [50]:
#Integer location based indexing by position
df_olympic_series.iloc[0:2]

      No of participating countries Host cities
2012                            205      London
2008                            204     Beijing

In [51]:
# select data element by condition where number of participating countries are more than 200
#hint - use Boolean expression
df_olympic_series[df_olympic_series['No of participating countries']>200]

      No of participating countries Host cities
2012                            205      London
2008                            204     Beijing
2004                            201      Athens

In [52]:
# Handling missing values
import pandas as pd
#declare first series
first_series=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [53]:
# declare second series
second_series=pd.Series([10,20,30,40,50],index=['c','e','f','g','h'])

In [54]:
sum_of_series=first_series+second_series

In [55]:
sum_of_series

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [56]:
# dropNaN (Not a number) values from dataset
dropna_s=sum_of_series.dropna()

In [57]:
dropna_s

c    13.0
e    25.0
dtype: float64

In [58]:
# Fill NaN (Not a number) values with Zeroes(0)
fillna_s=sum_of_series.fillna(0)

In [59]:
fillna_s

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [60]:
#  fill values with zeroes before performing addition operation for missing indices
fill_NaN_with_zeroes_before_Sum=first_series.add (second_series,fill_value=0)

In [61]:
fill_NaN_with_zeroes_before_Sum

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

In [62]:
#declare movie rating dataframe : ratings from 1 to 5 (star * rating)
import pandas as pd
df_movie_rating=pd.DataFrame({'movie 1':[5,4,3,3,2,1],'movie 2':[4,5,2,3,4,2]},index=['Tom','Jeff','Peter','Ram','Ted','Paul'])

In [63]:
df_movie_rating

       movie 1  movie 2
Tom          5        4
Jeff         4        5
Peter        3        2
Ram          3        3
Ted          2        4
Paul         1        2

In [64]:
# Apply custom functions with the applymap method
def movie_grade(rating):
    if rating==5:
        return 'A'
    if rating==4:
        return 'B'
    if rating==3:
        return 'C'
    else:
        return 'F'

In [65]:
print (movie_grade(5))

A

In [66]:
df_movie_rating.applymap(movie_grade)# Apply map returns both Series and dataframe

      movie 1 movie 2
Tom         A       B
Jeff        B       A
Peter       C       F
Ram         C       C
Ted         F       B
Paul        F       F

In [67]:
df_test_scores=pd.DataFrame({'Test 1':[95,84,73,88,82,61],'Test 2':[74,75,82,73,77,79]},index=['Jack','Lewis','Patrick','Rich','Kelly','Pauls'])

In [38]:
df_test_scores.max()

Test 1    95
Test 2    82
dtype: int64

In [15]:
df_test_scores.min()

Test 1    61
Test 2    73
dtype: int64

In [16]:
df_test_scores.mean()

Test 1    80.500000
Test 2    76.666667
dtype: float64

In [17]:
df_test_scores.std()

Test 1    11.979149
Test 2     3.386247
dtype: float64

In [68]:
#Data operation using groupby
df_president_name=pd.DataFrame({'first':['George','Bill','Ronald','Jimmy','George'],'second':['Bush','Clinton','Regan','Carter','Washington']})

In [69]:
df_president_name

    first      second
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [70]:
grouped=df_president_name.groupby('first')

In [71]:
grp_data=grouped.get_group('George')

In [72]:
grp_data

    first      second
0  George        Bush
4  George  Washington

In [73]:
df_president_name.sort_values('first')

    first      second
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

In [74]:
#Standardize a dataset
def standardize_tests(test):
    return (test-test.mean())/test.std()

In [75]:
standardize_tests(df_test_scores['Test 1'])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Pauls     -1.627829
Name: Test 1, dtype: float64

In [76]:
#Apply the function to the entire dataset
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_tests) # Apply method can only return dataframe

In [78]:
#Standardize test data is applied to the entire dataframe
standardize_test_scores(df_test_scores)

           Test 1    Test 2
Jack     1.210437 -0.787499
Lewis    0.292174 -0.492187
Patrick -0.626088  1.574998
Rich     0.626088 -1.082811
Kelly    0.125218  0.098437
Pauls   -1.627829  0.689062

In [79]:
# Pandas data operation - MErge , Duplicate and concatenation
df_student_math=pd.DataFrame({'student':['Tom','Jack','Dan','Ram','Jeff','David'],'ID':[10,56,31,85,9,22]})

In [80]:
df_student_science=pd.DataFrame({'student':['Tom','Ram','David'],'ID':[10,12,22]})

In [81]:
pd.merge(df_student_math,df_student_science)

  student  ID
0     Tom  10
1   David  22

In [82]:
#merge with key on student
pd.merge(df_student_math,df_student_science,on='student')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [83]:
#merge left join on key ID and also fill NaN values with x
pd.merge(df_student_math,df_student_science,on='ID',how='left').fillna ('x')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         x
2       Dan  31         x
3       Ram  85         x
4      Jeff   9         x
5     David  22     David

In [87]:
#Concatenate dataframes
pd.concat([df_student_math,df_student_science])

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
0     Tom  10
1     Ram  12
2   David  22

In [88]:
pd.concat([df_student_math,df_student_science],ignore_index=True)

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [89]:
#define new dataset with student survey data
df_student_survey_data=pd.DataFrame({'student':['Tom','Jack','Tom','Ram','Jeff','Jack'],'ID':[10,56,10,85,9,56]})

In [90]:
df_student_survey_data

  student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [91]:
#check for duplicate values
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [92]:
df_student_survey_data.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [93]:
df_student_survey_data.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9